export default {
  header: {
    navigation: {
      author: 'Об авторе',
      stack: 'Стек',
      blog: 'Блог',
      contact: 'Связаться',
    },
  },
  footer: {
    title: 'Вы можете мне написать!',
    text: 'Справа предоставлена форма обратной связи, которая поможет вам связаться со мной.',
    more: 'Также внизу можно найти ссылки на различные сети.\nВы можете спокойно написать мне в телеграм и я постараюсь ответить вам в течение дня.',
  },
  development: {
    people: 'Сюда не ступала нога человека 0_0',
    elves: 'Знаете что общего у эльфов и этой страницы? Они не существуют.',
    back: 'Перейти на главную страницу',
    developer: 'Должно быть разработчик уснул на клавиатуре, ибо страница утеряна',
    hmm: 'С чего бы начать? 🤔',
    description: 'Эта страница не существует или находится в разработке. Попробуйте перейти по ссылке чуть позже.'
  },
  home: {
    hero: {
      title: 'О Nuxt, Vue, TypeScript и о многом другом',
      text: 'Привет! Меня зовут Даня, я работаю Фронтэнд-разработчиком уже 3 года. На данном сайте я делюсь опытом, технологиями, которые использую и просто рассказываю интересные вещи о разработке.',
    },
    git: {
      seeMore: 'Вы можете посмотреть мои работы тут!',
    },
    topics: {
      architecture: {
        title: 'Архитектура.',
        description: 'Для каждого разработчка жизненно необходимо уметь принимать решения, от которых зависит успех разработки',
      },
      development: {
        title: 'Разработка.',
        description: 'Уметь писать код - непросто.\nВ разработке зачастую больше думаешь, нежели пишешь.',
      },
      support: {
        title: 'Сопровождение.',
        description: 'Сопровождение кода занимает большую часть времени.\nЯ с радостью расскажу о рефакторинге, тестировании, а также устранении легаси.',
      },
    },
    projects: {
      researcher: {
        name: 'Researcher',
        description: 'App for storing links, videos, books and other information for researches',
      },
      blog: {
        name: 'Blog',
        description: 'Данный блог. Блог сделан на Nuxt 3, Vue, Typescript.',
      },
      metaparser: {
        name: 'Meta Scrapper',
        description: 'Парсер мета-информации написанный на JavaScript с использованием типизации из Typescript.',
      },
      promisifyMedia: {
        name: 'Promisify.media',
        description: 'Библиотека, которая помогает обернуть в промис загрузку аудио-файлов со сторонних сервисов',
      },
      kaomoji: {
        name: 'vue-kaomoji',
        description: 'Библиотека, которая предлагает на выбор японские эмодзи (каомодзи), которые сделаны из текстовых символов',
      },
    },
  },
  about: {
    hero: {
      name: 'Даниил Шило',
      profession: 'Фронтэнд Инженер',
      description: 'Привет! Меня зовут Даниил, я родился в Луганске, в 2002 году. Еще с детства я был увлечен компьютерными науками, вставал с утра пораньше, лишь бы только подольше посидеть перед монитором 😅\n В юношестве мое увлечение и хобби переросло работу. Я часто пишу статьи на темы фронтэнда и UNIX-подобных систем в своем блоге, а также на Хабре.',
    },
    bio: {
      title: 'Еще с детства мне нравилось создавать что-то новое. Сначала это были игры, потом мелкие скрипты на Powershell. Время идет, а мне все так же нравится создавать что-то новое, только теперь мне еще и платят :)',
      details: {
        experience: {
          title: 'Опыт работы 👨‍💻',
          text: 'Путь как веб-разработчика начался в университете, учился по специальности "Программная инженерия", получил много опыта и начал работать фрилансером.\nПо началу брал легкие заказы: лендинги, продуктовые страницы на Wordpress и мелкие скрипты. Позже начал знакомиться с TypeScript, Vue, React, Node.js и Express, какое-то время работал фулл-стек разработчиком, но понял что душа лежит больше к клиентской части. Разрабатывал стриминговую платформу для обучения студентов IT-курсов, маркетплейсы, а также корпоративный мессенджер. Получил огромный опыт от каждой работы.\nРаботаю в удаленном формате уже 3 года.',
        },
        study: {
          title: 'Стек и обучение ✍️',
          text: 'Я достаточно много учусь, практически каждый день. В основном это конечно же касается фронтэнда и (иногда) бэкенда. У меня достаточно большой стек технологий, который я использовал в коммерческих решениях, если вы хотите узнать все фреймворки, то советую вам кликнуть вверху на раздел "Стек" :)',
        },
      },
    },
  },
  stack: {
    navigation: {
      frontend: 'Фронтэнд',
      backend: 'Бэкенд',
      testing: 'Тестирование',
      other: 'Другое',
      sublist: {
        framework: 'Фреймворки',
        library: 'Библиотеки',
        additional: 'Утилиты',
      }
    },
  },
};
