export default {
  header: {
    navigation: {
      author: 'Об авторе',
      stack: 'Стек',
      blog: 'Блог',
      contact: 'Связаться',
    },
  },
  footer: {
    title: 'Вы можете мне написать!',
    text: 'Справа предоставлена форма обратной связи, которая поможет вам связаться со мной.',
    more: 'Также внизу можно найти ссылки на различные сети.\nВы можете спокойно написать мне в телеграм и я постараюсь ответить вам в течение дня.',
  },
  home: {
    hero: {
      title: 'О Nuxt, Vue, TypeScript и о много другом',
      text: 'Привет! Меня зовут Даня, я работаю Фронтэнд-разработчиком уже 3 года. На данном сайте я делюсь опытом, технологиями, которые использую и просто рассказываю интересные вещи о разработке.',
    },
    git: {
      seeMore: 'Вы можете посмотреть мои работы тут!',
    },
    topics: {
      architecture: {
        title: 'Архитектура.',
        description: 'Для каждого разработчка жизненно необходимо уметь принимать решения, от которых зависит успех разработки',
      },
      development: {
        title: 'Разработка.',
        description: 'Уметь писать код - непросто.\nВ разработке зачастую больше думаешь, нежели пишешь.',
      },
      support: {
        title: 'Сопровождение.',
        description: 'Сопровождение кода занимает большую часть времени.\nЯ с радостью расскажу о рефакторинге, тестировании, а также устранении легаси.',
      },
    },
    projects: {
      researcher: {
        name: 'Researcher',
        description: 'App for storing links, videos, books and other information for researches',
      },
      blog: {
        name: 'Blog',
        description: 'Данный блог. Блог сделан на Nuxt 3, Vue, Typescript.',
      },
      metaparser: {
        name: 'Meta Parser JS',
        description: 'Парсер мета-информации написанный на JavaScript с использованием типизации из Typescript.\nС помощью данной библиотеки можно парсить данные с сайтов и использовать мета-информацию из них.',
      },
    },
  },
};
